tuya/TuyaOpen-GigaDevice/gd32_os/MSDK/cloud/azureiot/demos/projects/GD32VW553/sample_azure_iot_pnp_simulated_data_gd.c
    xResult = AzureIoTHubClientProperties_BuilderEndComponent( &xAzureIoTHubClient, &xWriter );
    configASSERT( xResult == eAzureIoTSuccess );

    xResult = AzureIoTJSONWriter_AppendEndObject( &xWriter );
    configASSERT( xResult == eAzureIoTSuccess );

    lBytesWritten = AzureIoTJSONWriter_GetBytesUsed( &xWriter );

    if( lBytesWritten <= 0 )
    {
        LogError( ( "Error getting the bytes written for the properties confirmation JSON" ) );
    }
    else
    {
        LogDebug( ( "Sending acknowledged writable property. Payload: %.*s", lBytesWritten, pucResponseBuffer ) );
        xResult = AzureIoTHubClient_SendPropertiesReported( &xAzureIoTHubClient, pucResponseBuffer, lBytesWritten, NULL );

        if( xResult != eAzureIoTSuccess )
        {
            LogError( ( "There was an error sending the reported properties: 0x%08x", xResult ) );
        }
    }


    return ( uint32_t ) lBytesWritten;
}
/*-----------------------------------------------------------*/

/**
 * @brief Property message callback handler
 */
void vHandleWritableProperties( AzureIoTHubClientPropertiesResponse_t * pxMessage,
                                uint8_t * pucWritablePropertyResponseBuffer,
                                uint32_t ulWritablePropertyResponseBufferSize,
                                uint32_t * pulWritablePropertyResponseBufferLength )
{
    AzureIoTResult_t xAzIoTResult;
    AzureIoTJSONReader_t xJsonReader;
    const uint8_t * pucComponentName = NULL;
    uint32_t ulComponentNameLength = 0;
    uint32_t ulPropertyVersion;
    bool xUpdatedLedValue;

    LogInfo( ( "Writable properties received: %.*s\r\n",
               ( int16_t ) pxMessage->ulPayloadLength, ( char * ) pxMessage->pvMessagePayload ) );

    xAzIoTResult = AzureIoTJSONReader_Init( &xJsonReader, pxMessage->pvMessagePayload, pxMessage->ulPayloadLength );

    if( xAzIoTResult != eAzureIoTSuccess )
    {
        LogError( ( "AzureIoTJSONReader_Init failed: result 0x%08x", ( uint16_t ) xAzIoTResult ) );
        *pulWritablePropertyResponseBufferLength = 0;
        return;
    }

    xAzIoTResult = AzureIoTHubClientProperties_GetPropertiesVersion( &xAzureIoTHubClient, &xJsonReader, pxMessage->xMessageType, &ulPropertyVersion );

    if( xAzIoTResult != eAzureIoTSuccess )
    {
        LogError( ( "AzureIoTHubClientProperties_GetPropertiesVersion failed: result 0x%08x", ( uint16_t ) xAzIoTResult ) );
        *pulWritablePropertyResponseBufferLength = 0;
        return;
    }

    xAzIoTResult = AzureIoTJSONReader_Init( &xJsonReader, pxMessage->pvMessagePayload, pxMessage->ulPayloadLength );

    if( xAzIoTResult != eAzureIoTSuccess )
    {
        LogError( ( "AzureIoTJSONReader_Init failed: result 0x%08x", ( uint16_t ) xAzIoTResult ) );
        *pulWritablePropertyResponseBufferLength = 0;
        return;
    }

    /**
     * If the PnP component is for Azure Device Update, function
     * AzureIoTADUClient_SendResponse shall be used to publish back the
     * response for the ADU writable properties.
     * Thus, to prevent this callback to publish a response in duplicate,
     * pulWritablePropertyResponseBufferLength must be set to zero.
     */
    *pulWritablePropertyResponseBufferLength = 0;

    while( ( xAzIoTResult = AzureIoTHubClientProperties_GetNextComponentProperty( &xAzureIoTHubClient, &xJsonReader,
                                                                                  pxMessage->xMessageType, eAzureIoTHubClientPropertyWritable,
                                                                                  &pucComponentName, &ulComponentNameLength ) ) == eAzureIoTSuccess )
    {
        LogInfo( ( "Properties component name: %.*s", ( int16_t ) ulComponentNameLength, pucComponentName ) );

        if( AzureIoTADUClient_IsADUComponent( &xAzureIoTADUClient, pucComponentName, ulComponentNameLength ) )
        {
            AzureIoTADURequestDecision_t xRequestDecision;
            //LogInfo( ("Payload: %s", pxMessage->pvMessagePayload) );

            xAzIoTResult = AzureIoTADUClient_ParseRequest(
                &xAzureIoTADUClient,
                &xJsonReader,
                &xAzureIoTAduUpdateRequest );

            if( xAzIoTResult != eAzureIoTSuccess )
            {
                LogError( ( "AzureIoTADUClient_ParseRequest failed: result 0x%08x", ( uint16_t ) xAzIoTResult ) );
                *pulWritablePropertyResponseBufferLength = 0;
                return;
            }

            if( xAzureIoTAduUpdateRequest.xWorkflow.xAction == eAzureIoTADUActionApplyDownload )
            {
                LogInfo( ( "Verifying JWS Manifest" ) );
                xAzIoTResult = AzureIoTJWS_ManifestAuthenticate( xAzureIoTAduUpdateRequest.pucUpdateManifest,
                                                                 xAzureIoTAduUpdateRequest.ulUpdateManifestLength,
                                                                 xAzureIoTAduUpdateRequest.pucUpdateManifestSignature,
                                                                 xAzureIoTAduUpdateRequest.ulUpdateManifestSignatureLength,
                                                                 &xADURootKeys[ 0 ],
                                                                 sizeof( xADURootKeys ) / sizeof( xADURootKeys[ 0 ] ),
                                                                 ucADUScratchBuffer,
                                                                 sizeof( ucADUScratchBuffer ) );

                if( xAzIoTResult != eAzureIoTSuccess )
                {
                    LogError( ( "AzureIoTJWS_ManifestAuthenticate failed: JWS was not validated successfully: result 0x%08x", ( uint16_t ) xAzIoTResult ) );
                    return;
                }

                xRequestDecision = prvUserDecideShouldStartUpdate( &xAzureIoTAduUpdateRequest );

                xAzIoTResult = AzureIoTADUClient_SendResponse(
                    &xAzureIoTADUClient,
                    &xAzureIoTHubClient,
                    xRequestDecision,
                    ulPropertyVersion,
                    pucWritablePropertyResponseBuffer,
                    ulWritablePropertyResponseBufferSize,
                    NULL );

                if( xAzIoTResult != eAzureIoTSuccess )
                {
                    LogError( ( "AzureIoTADUClient_GetResponse failed: result 0x%08x", ( uint16_t ) xAzIoTResult ) );
                    return;
                }

                if( xRequestDecision == eAzureIoTADURequestDecisionAccept )
                {
                    xProcessUpdateRequest = true;
                }
            }
            else if( xAzureIoTAduUpdateRequest.xWorkflow.xAction == eAzureIoTADUActionCancel )
            {
                /*Nothing to do here but set process to "true", where we will then send state as "Idle" */
                xProcessUpdateRequest = true;

                LogInfo( ( "ADU manifest received: action cancelled" ) );
            }
            else
            {
                xProcessUpdateRequest = false;

                LogInfo( ( "ADU manifest received: action unknown" ) );
            }
        }
#ifdef CONFIG_AZURE_F527_DEMO_SUPPORT
            else if( AzureIoTJSONReader_TokenIsTextEqual( &xJsonReader,
                                                          ( const uint8_t * ) sampleazureiotPROPERTY_INDICATE_LED_TEXT,
                                                          sizeof( sampleazureiotPROPERTY_INDICATE_LED_TEXT ) - 1 ) )
        {
            xAzIoTResult = AzureIoTJSONReader_NextToken( &xJsonReader );
            configASSERT( xAzIoTResult == eAzureIoTSuccess );

            /* Get Indicate Led value */
            xAzIoTResult = AzureIoTJSONReader_GetTokenBool( &xJsonReader, &xUpdatedLedValue );

            if( xAzIoTResult != eAzureIoTSuccess )
            {
                LogError( ( "Error getting the property version: result 0x%08x", xAzIoTResult ) );
                break;
            }

            xAzIoTResult = AzureIoTJSONReader_NextToken( &xJsonReader );
            configASSERT( xAzIoTResult == eAzureIoTSuccess );
            prvUpdateLocalIndicateLed( xUpdatedLedValue );
            *pulWritablePropertyResponseBufferLength = prvGenerateAckForIncomingLed (
                                                            xUpdatedLedValue,
                                                            ulPropertyVersion,
                                                            pucWritablePropertyResponseBuffer,
                                                            ulWritablePropertyResponseBufferSize );
        }
#endif
        else
        {
            LogInfo( ( "Component not ADU: %.*s", ( int16_t ) ulComponentNameLength, pucComponentName ) );
            prvSkipPropertyAndValue( &xJsonReader );
        }
    }
}
/*-----------------------------------------------------------*/

/**
 * @brief Implements the sample interface for generating reported properties payload.
 */
uint32_t ulCreateReportedPropertiesUpdate( uint8_t * pucPropertiesData,
                                           uint32_t ulPropertiesDataSize )
{
    /* No reported properties to send if length is zero. */
    uint32_t lBytesWritten = 0;
    AzureIoTResult_t xResult;
    AzureIoTJSONWriter_t xWriter;

    /* Building the acknowledgement payload for the indicateLed property. */
    xResult = AzureIoTJSONWriter_Init( &xWriter, pucPropertiesData, ulPropertiesDataSize );
    configASSERT( xResult == eAzureIoTSuccess );

    xResult = AzureIoTJSONWriter_AppendBeginObject( &xWriter );
    configASSERT( xResult == eAzureIoTSuccess );

    xResult = AzureIoTHubClientProperties_BuilderBeginComponent( &xAzureIoTHubClient, &xWriter, ( const uint8_t * ) AZ_IOT_CHARGE_SENSOR_PROPERTIES_COMPONENT_NAME,
                                                                      strlen( AZ_IOT_CHARGE_SENSOR_PROPERTIES_COMPONENT_NAME ) );
    configASSERT( xResult == eAzureIoTSuccess );

    xResult = AzureIoTJSONWriter_AppendPropertyWithBoolValue( &xWriter, ( const uint8_t * ) sampleazureiotPROPERTY_INDICATE_LED_TEXT,
                                                                       sizeof( sampleazureiotPROPERTY_INDICATE_LED_TEXT ) - 1,
                                                                       xDeviceCurrentIndicateLedValue
                                                                       );
    configASSERT( xResult == eAzureIoTSuccess );

