tuya/TuyaOpen-GigaDevice/gd32_os/MSDK/cloud/azureiot/demos/projects/GD32VW553/sample_azure_iot_pnp_simulated_data_gd.c
    xResult = AzureIoTHubClientProperties_BuilderEndComponent( &xAzureIoTHubClient, &xWriter );
    configASSERT( xResult == eAzureIoTSuccess );

    xResult = AzureIoTJSONWriter_AppendEndObject( &xWriter );
    configASSERT( xResult == eAzureIoTSuccess );

    lBytesWritten = AzureIoTJSONWriter_GetBytesUsed( &xWriter );

    return lBytesWritten;
}
/*-----------------------------------------------------------*/

/**
 * @brief Command message callback handler
 */
uint32_t ulHandleCommand( AzureIoTHubClientCommandRequest_t * pxMessage,
                          uint32_t * pulResponseStatus,
                          uint8_t * pucCommandResponsePayloadBuffer,
                          uint32_t ulCommandResponsePayloadBufferSize )
{
    AzureIoTResult_t xResult;
    AzureIoTJSONReader_t xReader;
    AzureIoTJSONWriter_t xWriter;
    int32_t lCommandNameLength;
    int32_t ulCommandResponsePayloadLength;

    LogInfo( ( "Command payload : %.*s \r\n",
               ( int16_t ) pxMessage->ulPayloadLength,
               ( const char * ) pxMessage->pvMessagePayload ) );

    lCommandNameLength = sizeof( sampleazureiotCOMMAND_Reboot_REPORT ) - 1;

    if( ( lCommandNameLength == pxMessage->usCommandNameLength ) &&
        ( strncmp( sampleazureiotCOMMAND_Reboot_REPORT, ( const char * ) pxMessage->pucCommandName, lCommandNameLength ) == 0 ) )
    {
        /* Is for reboot cmd */

        /*Initialize the reader from which we pull the "since". */
        xResult = AzureIoTJSONReader_Init( &xReader, pxMessage->pvMessagePayload, pxMessage->ulPayloadLength );
        configASSERT( xResult == eAzureIoTSuccess );

        /* Initialize the JSON writer with a buffer to which we will write the response payload. */
        xResult = AzureIoTJSONWriter_Init( &xWriter, pucCommandResponsePayloadBuffer, ulCommandResponsePayloadBufferSize );
        configASSERT( xResult == eAzureIoTSuccess );

        /* Read from the writer the "Delay" value and use it to construct the response payload in the writer. */
        xResult = prvInvokeRebootCommand( &xReader, &xWriter );
        if( xResult == eAzureIoTSuccess )
        {
            ulCommandResponsePayloadLength = AzureIoTJSONWriter_GetBytesUsed( &xWriter );

            *pulResponseStatus = AZ_IOT_STATUS_OK;
        }
        else
        {
            LogError( ( "Error generating command payload: result 0x%08x", xResult ) );

            *pulResponseStatus = 501;
            ulCommandResponsePayloadLength = sizeof( sampleazureiotCOMMAND_EMPTY_PAYLOAD ) - 1;
            configASSERT( ulCommandResponsePayloadBufferSize >= ulCommandResponsePayloadLength );
            ( void ) memcpy( pucCommandResponsePayloadBuffer, sampleazureiotCOMMAND_EMPTY_PAYLOAD, ulCommandResponsePayloadLength );
        }
    }
    else
    {
        /* Not for max min report (not for this device) */
        LogInfo( ( "Received command is not for this device: %.*s",
                   pxMessage->usCommandNameLength,
                   pxMessage->pucCommandName ) );

        *pulResponseStatus = AZ_IOT_STATUS_NOT_FOUND;
        ulCommandResponsePayloadLength = sizeof( sampleazureiotCOMMAND_EMPTY_PAYLOAD ) - 1;
        configASSERT( ulCommandResponsePayloadBufferSize >= ulCommandResponsePayloadLength );
        ( void ) memcpy( pucCommandResponsePayloadBuffer, sampleazureiotCOMMAND_EMPTY_PAYLOAD, ulCommandResponsePayloadLength );
    }

    return ulCommandResponsePayloadLength;
}


/*-----------------------------------------------------------*/

/**
 * @brief Implements the sample interface for generating Telemetry payload.
 */
uint32_t ulCreateTelemetry( uint8_t * pucTelemetryData,
                            uint32_t ulTelemetryDataSize,
                            uint32_t * ulTelemetryDataLength )
{
    int result = snprintf( ( char * ) pucTelemetryData, ulTelemetryDataSize,
                           sampleazureiotTELEMETRY_MESSAGE, xDeviceCurrentChargeStatus );

    if( ( result >= 0 ) && ( result < ulTelemetryDataSize ) )
    {
        *ulTelemetryDataLength = result;
        result = 0;
    }
    else
    {
        result = 1;
    }

    return result;
}

/*-----------------------------------------------------------*/
